In [ ]:
# !pip install pyspark
# Install the 'findsparkâ€™ Python module through the Anaconda Prompt or Terminal by running 
# python -m pip install findspark

In [1]:
pwd

'C:\\Users\\nitis\\Downloads\\Documents\\PySpark'

## Importing libraries

In [2]:
import findspark
findspark.init()

In [3]:
import pyspark # only run after findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [5]:
df = spark.sql('''select "spark" as hello''')
df.show()

+-----+
|hello|
+-----+
|spark|
+-----+

In [6]:
### Using SPARK
spark=SparkSession.builder.appName("Practise").getOrCreate()

In [5]:
spark

### Reading VIA Spark

In [6]:
df_spark=spark.read.csv("sample.csv")
df_spark

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string]

In [8]:
df_spark.show()

+-----+---+------+-------------+
|  _c0|_c1|   _c2|          _c3|
+-----+---+------+-------------+
| Name|Age|Salary|         City|
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [9]:
## In order to read the data excluding _c0,_C1,_c2 and _C3
df_spark=spark.read.option("header","true").csv("Sample.csv")
df_spark

DataFrame[Name: string, Age: string, Salary: string, City: string]

In [10]:
spark.read.option("header","true").csv("Sample.csv").show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [11]:
## Checking Type
type(df_spark)

pyspark.sql.dataframe.DataFrame

In [12]:
## Checking diff diff meathods
df_spark.head()

Row(Name='Ankit', Age='22', Salary='100', City='Delhi')

## Chapter 2

In [26]:
spark=SparkSession.builder.appName("DataFrame").getOrCreate()
spark

In [60]:
## Reading Dataset
df_spark=spark.read.option("header","true").csv("Sample.csv")
df_spark

DataFrame[Name: string, Age: string, Salary: string, City: string]

In [61]:
df_spark.show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [30]:
## Checking the Schema(data_types)
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- Salary: string (nullable = true)
 |-- City: string (nullable = true)

### Note Here--
* all columns are taken as string even Age, Salary to solve this we have to use

`inferschema=True`

In [7]:
df_spark=spark.read.option("header","true").csv("Sample.csv",inferSchema=True)
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- City: string (nullable = true)

In [8]:
import pandas as pd
df=pd.read_csv("sample.csv")
df

    Name  Age  Salary           City
0  Ankit   22     100          Delhi
1  Mohit   21     200  Muzaffarnagar
2   Aman   11     250         Meerut
3  Rahul   33     300            Goa

#### Difference out the string and integer variable

In [15]:
## using the pandas
[i for i in df.columns if df[i].dtypes=="int64"]

['Age', 'Salary']

## using Spark

In [17]:
vl=[i for i in df_spark.columns if df_spark.select([i]).dtypes[0][1]=="int"]
vl

['Age', 'Salary']

## Meathod-2

In [62]:
df_spark=spark.read.csv("Sample.csv",header=True,inferSchema=True)
df_spark

DataFrame[Name: string, Age: int, Salary: int, City: string]

In [63]:
df_spark.show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [34]:
df_spark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- City: string (nullable = true)

In [35]:
## To get all the columns
df_spark.columns

['Name', 'Age', 'Salary', 'City']

In [37]:
## seleting top 3 records
df_spark.head(2)

[Row(Name='Ankit', Age=22, Salary=100, City='Delhi'),
 Row(Name='Mohit', Age=21, Salary=200, City='Muzaffarnagar')]

### Diference between pandas head and pyspark head is that
* In pyspark we get output in the form of list

In [39]:
df.head(2)

    Name  Age  Salary           City
0  Ankit   22     100          Delhi
1  Mohit   21     200  Muzaffarnagar

## Selecting columns

In [41]:
df_spark.show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [64]:
df_spark.select("Name","Age").show()

+-----+---+
| Name|Age|
+-----+---+
|Ankit| 22|
|Mohit| 21|
| Aman| 11|
|Rahul| 33|
+-----+---+

## Checking Datatypes

In [49]:
df_spark.dtypes

[('Name', 'string'), ('Age', 'int'), ('Salary', 'int'), ('City', 'string')]

In [65]:
df_spark.describe().show()

+-------+-----+----------------+-----------------+-------------+
|summary| Name|             Age|           Salary|         City|
+-------+-----+----------------+-----------------+-------------+
|  count|    4|               4|                4|            4|
|   mean| null|           21.75|            212.5|         null|
| stddev| null|8.99536917900909|85.39125638299666|         null|
|    min| Aman|              11|              100|        Delhi|
|    max|Rahul|              33|              300|Muzaffarnagar|
+-------+-----+----------------+-----------------+-------------+

## Adding columns in the dataframe

In [66]:
df_spark.withColumn("Experience",df_spark["Age"]-10).show()

+-----+---+------+-------------+----------+
| Name|Age|Salary|         City|Experience|
+-----+---+------+-------------+----------+
|Ankit| 22|   100|        Delhi|        12|
|Mohit| 21|   200|Muzaffarnagar|        11|
| Aman| 11|   250|       Meerut|         1|
|Rahul| 33|   300|          Goa|        23|
+-----+---+------+-------------+----------+

In [67]:
df_spark.show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

In [68]:
df_spark=df_spark.withColumn("Experience",df_spark["Age"]-10)
df_spark.show()

+-----+---+------+-------------+----------+
| Name|Age|Salary|         City|Experience|
+-----+---+------+-------------+----------+
|Ankit| 22|   100|        Delhi|        12|
|Mohit| 21|   200|Muzaffarnagar|        11|
| Aman| 11|   250|       Meerut|         1|
|Rahul| 33|   300|          Goa|        23|
+-----+---+------+-------------+----------+

#### Dropping the columns

In [69]:
df_spark.drop("Experience")
df_spark.show()

+-----+---+------+-------------+----------+
| Name|Age|Salary|         City|Experience|
+-----+---+------+-------------+----------+
|Ankit| 22|   100|        Delhi|        12|
|Mohit| 21|   200|Muzaffarnagar|        11|
| Aman| 11|   250|       Meerut|         1|
|Rahul| 33|   300|          Goa|        23|
+-----+---+------+-------------+----------+

In [ ]:
## Element has not removed coz thee i no inplace operator

In [70]:
df_spark=df_spark.drop("Experience")
df_spark.show()

+-----+---+------+-------------+
| Name|Age|Salary|         City|
+-----+---+------+-------------+
|Ankit| 22|   100|        Delhi|
|Mohit| 21|   200|Muzaffarnagar|
| Aman| 11|   250|       Meerut|
|Rahul| 33|   300|          Goa|
+-----+---+------+-------------+

#### Renaming the columns

In [72]:
df_spark.withColumnRenamed("Name","New_Name").show()

+--------+---+------+-------------+
|New_Name|Age|Salary|         City|
+--------+---+------+-------------+
|   Ankit| 22|   100|        Delhi|
|   Mohit| 21|   200|Muzaffarnagar|
|    Aman| 11|   250|       Meerut|
|   Rahul| 33|   300|          Goa|
+--------+---+------+-------------+

# Chapter -3

In [73]:
## reading the new dataset
spark.read.csv("test1.csv",header=True,inferSchema=True)

DataFrame[Name: string, age: int, Experience: int, Salary: int]

In [74]:
df=spark.read.csv("test1.csv",header=True,inferSchema=True)
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

### dropping null values from all the rows

In [75]:
df.na.drop().show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

### How="Any" and "all" in drop
* how="all" --> means if any value in the row is null it get drop
* how="all" --> means if all the values in the row is null it get dropped
* By default how="any" in the drop

In [76]:
df.na.drop(how="all").show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [77]:
df.na.drop(how="any").show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

## Threshold
* if we put thresh=2, it means if the row dont have 2 non-null values it got deleted

In [78]:
df.na.drop(how="any",thresh=2).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
+---------+----+----------+------+

In [79]:
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

## Subset
* when want to delete the vaue from a specific column

In [82]:
df.na.drop(how="any",subset=["Name"]).show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
+---------+----+----------+------+

In [83]:
df.na.drop(how="any",subset=["Name","age"]).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

## Filling the missing values

In [84]:
df.na.fill("missing_values").show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|null|      null| 40000|
|missing_values|  34|        10| 38000|
|missing_values|  36|      null|  null|
+--------------+----+----------+------+

* In order to fill only a aspecific column use subset

In [85]:
df.na.fill("missing_values",subset=["Name"]).show()

+--------------+----+----------+------+
|          Name| age|Experience|Salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|          Paul|  24|         3| 20000|
|        Harsha|  21|         1| 15000|
|       Shubham|  23|         2| 18000|
|        Mahesh|null|      null| 40000|
|missing_values|  34|        10| 38000|
|missing_values|  36|      null|  null|
+--------------+----+----------+------+

## Imputing numeric column with mean

In [91]:
from pyspark.ml.feature import Imputer
impute=Imputer(
    inputCols=["age","Experience","Salary"],
              outputCols=["{}_Imputed".format(c) for c  in ["age","Experience","Salary"]]## creating new columns
                                                                                           #having imputed value
).setStrategy("mean")

In [92]:
impute.fit(df).transform(df).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|age_Imputed|Experience_Imputed|Salary_Imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|null|      null| 40000|         28|                 5|         40000|
|     null|  34|        10| 38000|         34|                10|         38000|
|     null|  36|      null|  null|         36|                 5|         25750|
+---------+----+----------+------+-----------+------------------+--------------+

# Chapter 4

In [14]:
spark=SparkSession.builder.appName("DataFrm").getOrCreate()

In [16]:
df=spark.read.csv("test.csv",header=True,inferSchema=True)
df.show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

### filter Operation

In [18]:
## Salary of the people less than 20000
df.filter("Salary<=20000").show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

In [20]:
## Selecting columns with filters
df.filter("Salary<=20000").select(["Name","age"]).show()

+-------+---+
|   Name|age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
| Harsha| 21|
|Shubham| 23|
+-------+---+

## 2nd Way

In [29]:
df.filter(df["Salary"]<=20000).select(["Name","age","Salary"]).show()

+-------+---+------+
|   Name|age|Salary|
+-------+---+------+
|  Sunny| 29| 20000|
|   Paul| 24| 20000|
| Harsha| 21| 15000|
|Shubham| 23| 18000|
+-------+---+------+

## 3rd way

In [ ]:
df.where("Salary<=20000").orderBy("Name").show()

### Putting 2 conditions together

In [30]:
df.filter((df["Salary"]<=20000) & (df["age"]>=23)).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

## INverse filter operation

In [40]:
df.filter(~(df["Salary"]>20000)).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
|  Sunny| 29|         4| 20000|
|   Paul| 24|         3| 20000|
| Harsha| 21|         1| 15000|
|Shubham| 23|         2| 18000|
+-------+---+----------+------+

# Chapter -5

In [5]:
spark=SparkSession.builder.appName("Practise").getOrCreate()

In [34]:
df=spark.read.csv("test2.csv",header=True,inferSchema=True)
df

DataFrame[Name: string, Departments: string, salary: int, Hours: int]

In [35]:
df.show()

+---------+------------+------+-----+
|     Name| Departments|salary|Hours|
+---------+------------+------+-----+
|    Krish|Data Science| 10000|    5|
|    Krish|         IOT|  5000|    3|
|   Mahesh|    Big Data|  4000|    6|
|    Krish|    Big Data|  4000|    2|
|   Mahesh|Data Science|  3000|    5|
|Sudhanshu|Data Science| 20000|    4|
|Sudhanshu|         IOT| 10000|    8|
|Sudhanshu|    Big Data|  5000|    4|
|    Sunny|Data Science| 10000|    5|
|    Sunny|    Big Data|  2000|    5|
+---------+------------+------+-----+

In [8]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Departments: string (nullable = true)
 |-- salary: integer (nullable = true)
 |-- _c3: string (nullable = true)

## GroupBY

In [36]:
df.groupby("Name").sum().show()

+---------+-----------+----------+
|     Name|sum(salary)|sum(Hours)|
+---------+-----------+----------+
|Sudhanshu|      35000|        16|
|    Sunny|      12000|        10|
|    Krish|      19000|        10|
|   Mahesh|       7000|        11|
+---------+-----------+----------+

## Group by slected columns

In [38]:
## count num of depatment
df.groupby("Departments").avg("Hours").show()

+------------+----------+
| Departments|avg(Hours)|
+------------+----------+
|         IOT|       5.5|
|    Big Data|      4.25|
|Data Science|      4.75|
+------------+----------+

### Applying agg function directly

In [30]:
df.agg({"Salary" : "sum"}).show()

+-----------+
|sum(Salary)|
+-----------+
|      73000|
+-----------+

# Training -------------------------- ####################

In [7]:
from pyspark.sql.functions import col

In [8]:
df=spark.read.csv("test1.csv",header=True,inferSchema=True)
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|null|      null| 40000|
|     null|  34|        10| 38000|
|     null|  36|      null|  null|
+---------+----+----------+------+

In [11]:
df.filter(col("age").isNotNull()).withColumn("Bonus",(col("Experience")*500).cast("int")).sort(col("Bonus").asc()).show()

+---------+---+----------+------+-----+
|     Name|age|Experience|Salary|Bonus|
+---------+---+----------+------+-----+
|     null| 36|      null|  null| null|
|   Harsha| 21|         1| 15000|  500|
|  Shubham| 23|         2| 18000| 1000|
|     Paul| 24|         3| 20000| 1500|
|    Sunny| 29|         4| 20000| 2000|
|Sudhanshu| 30|         8| 25000| 4000|
|    Krish| 31|        10| 30000| 5000|
|     null| 34|        10| 38000| 5000|
+---------+---+----------+------+-----+

In [15]:
nv=df.select("age",col("Name").alias("naam"))
nv.show()

+----+---------+
| age|     naam|
+----+---------+
|  31|    Krish|
|  30|Sudhanshu|
|  29|    Sunny|
|  24|     Paul|
|  21|   Harsha|
|  23|  Shubham|
|null|   Mahesh|
|  34|     null|
|  36|     null|
+----+---------+

In [17]:
nv=df.selectExpr("age","Name","Name in ('Krish','Sunny') as Name_select")
nv.show()

+----+---------+-----------+
| age|     Name|Name_select|
+----+---------+-----------+
|  31|    Krish|       true|
|  30|Sudhanshu|      false|
|  29|    Sunny|       true|
|  24|     Paul|      false|
|  21|   Harsha|      false|
|  23|  Shubham|      false|
|null|   Mahesh|      false|
|  34|     null|       null|
|  36|     null|       null|
+----+---------+-----------+

In [22]:
df.select("Name").show()

+---------+
|     Name|
+---------+
|    Krish|
|Sudhanshu|
|    Sunny|
|     Paul|
|   Harsha|
|  Shubham|
|   Mahesh|
|     null|
|     null|
+---------+

In [13]:

columns = ["language","users_count"]
data = [("Java", 20000), ("Python", 100000), ("Scala", 3000)]

In [15]:
df1 = spark.createDataFrame(data).toDF(*columns)
df1.show()

+--------+-----------+
|language|users_count|
+--------+-----------+
|    Java|      20000|
|  Python|     100000|
|   Scala|       3000|
+--------+-----------+

In [16]:
df1.printSchema()

root
 |-- language: string (nullable = true)
 |-- users_count: long (nullable = true)

In [ ]:
spark.createDataFrame([("a",1),("b",2),("c",3)]).toDF(*["Name","Age"]).show()

In [51]:
rowData = map(lambda x: [i for i in x], data) 
rowData

In [52]:
dd3 = spark.createDataFrame(rowData,columns)

In [53]:
dd3

DataFrame[language: string, users_count: string, _3: string]

In [54]:
dd3.show()

+----------+-----------+-------+
|  language|users_count|     _3|
+----------+-----------+-------+
|student_id|       name|address|
+----------+-----------+-------+